{"sightings":[{"text":"Witnessed an orange, slow moving light. Was looking out my window and saw a orange colored, non blinking light floating across the night sky. Woke up my daughters to confirm what I was seeing. The object did not blink, was definitely not a helicopter. Very bright orange and moved slowly for about 2 minutes, disappeared behind the trees and did not see it again. Never seen anything like this in my life.","post_create_date_time":"10/2/2019 22:00","sighting_date":"10/2/2019","sighting_time":"22:00","city":"Black Mountain","state":"NC","shape":"Fireball","duration":"2 minutes","summary":"Witnessed an orange, slow moving light. Was looking out my window and saw a orange colored, non blinking light floating across the nigh"},{"text":"Glowing lights in formation  just south of San Quentin I witnessed 10 or 11 spherical glowing objects in formation swarming and hovering near the top of Ring Mtn. -Corte Madera.  I very quickly ran up to 2 firemen emergency responders to ask them to quote \"take a quick glance at what is going on over here\".  They flat out refused to take 5 steps over to the side to look at what I was trying to show them.  They were handling some kind of a medical emergency, but it would have been really nice to have them witness this because this was highlight of the whole night.","post_create_date_time":"10/2/2016 22:00","sighting_date":"10/2/2019","sighting_time":"21:00","city":"Marin County","state":"CA","shape":"Sphere","duration":"3 minutes","summary":"Glowing lights in formation  just south of San Quentin"},{"text":"I walked out onto my back deck, checking to make sure everything was inside before going to bed. As I walked out the door, a bright orange glowing object to my west immediately caught my attention. It was just hovering in place. Almost as if we were staring at each other for a moment. It was close enough I could see a sphere shaped object, with a very bright orange glow emerging from it. I heard no engine, no noise whatsoever ever. It was as quiet as the night sky can be. My husband and I live in a small rule town with no traffic, and very secluded. I was so caught off guard and could not believe what I was looking at. It was nothing I had ever seen before. I stared at this for probably 15-20 seconds. As I continued to stare I called out my husband’s name at least 3-4 times, getting louder each time. Once I started to scream for my husband, this object starts to move north in a very slow speed.","post_create_date_time":"10/2/2016 22:00","sighting_date":"10/2/2016","sighting_time":"23:00","city":"Monroe City","state":"MO","shape":"Sphere","duration":"5 minutes","summary":"Sphere clump of bright gold and white lights. silent and below the fog and fast."},{"city":"Oak Island","state":"NC","shape":"Circle","sighting_date":"10/2/2020","sighting_time":"21:00","duration":"200 minutes","summary":"Bright lights appeared off the coast, multiplied, disappeared, and a single light reappeared and vanished again.","text":"Bright lights appeared off the coast, multiplied, disappeared, and a single light reappeared and vanished again.We were driving down Beach Dr near 46th St SE when a set of white-red lights appeared off the coast, roughly 10,000 ft and several miles from the shoreline. Initially there were three lights, but as two of the lights got closer together they became 4. One light stayed alone to the East. Then the five lights came together and disappeared. Roughly 3 seconds later, a larger light appeared and then disappeared as quickly as it came. They never reappeared.","post_create_date_time":"10/2/2020 21:00"}]}